{
  "INTERNAL_LEGAL": {
    "ORANGE": "<h4>Legal information</h4>\n    <h5>Editor</h5>\n    <p>\n      Orange SA<br>\n      Public stock corporation incorporated in France with registered share capital of Euro 10 640 226 396<br>\n      RCS Nanterre 380 129 866<br>\n      Headquarters:<br>\n      111, quai du Président Roosevelt<br>\n      CS 70222<br>\n      92449 ISSY LES MOULINEAUX CEDEX<br>\n      France<br>\n      Tel: + 33 (0)1 44 44 22 22<br>\n      Publishing Director: Stéphane Richard\n    </p>\n\n    <h5>Credits</h5>\n    Orange Innovation"
  },
  "INTERNAL_PRIVACY": {
    "CONTENT": "<p>This Privacy Notice aims to give the User information on how Orange Innovation, acting as Data Controller,\n      processes his/her personal data when he/she uses its application SuperCodingBall.</p>\n    <p>This Notice may be supplemented by specific information relating to «SuperCodingBall» which is described in the relevant Terms and Conditions.</p>\n    <h4>What is «SuperCodingBall Service»?</h4>\n    <p>The Supercodingball service allows Users to learn about programming by creating a virtual football team and programming the behavior of each player.</p>\n    <h4>Why does Orange Innovation process personal data and under what legal basis?</h4>\n    <p>Through SuperCodingBall Service, Orange Innovation processes the User's data in order to:</p>\n    <table class=\"table\">\n      <thead>\n      <tr>\n        <th>Purposes</th>\n        <th>Legal basis</th>\n      </tr>\n      </thead>\n      <tr>\n        <td>Manage the registration of the User for participation in the online game (creation of a profile and an associated avatar)\n        </td>\n        <td>The processing is based on the performance of the terms and conditions the User agreed with when subscribing to SuperCodingBall Service.\n        </td>\n      </tr>\n      <tr>\n        <td>Manage the ranking between the players (storage of the results of the games played)</td>\n        <td>The processing is based on the performance of the terms and conditions the User agreed with when subscribing to SuperCodingBall Service.\n        </td>\n      </tr>\n      <tr>\n        <td>Monitor Orange Innovation activities (reporting and usage statistics)</td>\n        <td>This processing is based on the legitimate interest of Orange Innovation to measure the performance of its activity and improve its products and services.\n        </td>\n      </tr>\n    </table>\n    <h4>Which personal data is needed in the context of this service?</h4>\n    <p>The personal data Orange Innovation collects as part of this service are:</p>\n    <ul>\n      <li>User identification data (account name and associated avatar)</li>\n    </ul>\n    <h4>Who has access to the User's personal data?</h4>\n    <p>Within the limits of their respective attributions, the data collected may be accessible by or intended to:</p>\n    <ul>\n      <li>authorized internal services within Orange Innovation,</li>\n      <li>the service provider(s) in charge who process the data according to Orange Innovation' instructions.</li>\n    </ul>\n    <p>The User is informed that, in accordance with the laws and regulations in force, the data may be transmitted to competent authorities, at their request, as Authorized Third Parties.</p>\n    <h4>How long do we retain the User's personal information?</h4>\n    <p>Orange Innovation undertakes to keep the User's personal data for no longer than is necessary for the purposes for which it processes them, and in accordance with the regulations.</p>\n    <p>The User's personal data is processed as long as his/her user account is active. In case of deactivation, the User's data will be kept for 15 days from the deactivation date.</p>\n    <h4>What are the User's rights and how he/she can exercise them?</h4>\n    <p>In accordance with the regulations in force, the User has a right of access and of correction of his/her Personal Data and the right to request the deletion, the right to oppose the processing of his/her Personal Data and the right to obtain the limitation or portability of his/her Personal Data to the extent that this is applicable, subject to urgent, legitimate grounds Orange Innovation may show to retain his/her Data.</p>\n    <p>When the processing of personal data is based on the User's consent, he/she is informed he/she may withdraw his/her consent at any time.</p>\n    <p>The User may issue guidelines on the retention, erasure or disclosure of his/her personal data after his/her death.</p>\n    <p>To exercise his/her rights, The User can email us by justifying his/her identity in the 'Contact us' section of the Application.</p>\n    <p>The User is informed that he/she has the right to submit a request to the 'Commission Nationale de l'Informatique et des Libertés' (CNIL), the supervisory authority in charge of compliance with the obligations regarding personal data in France. Orange Innovation encourages the User to contact it before any request, so that they try to solve it.</p>\n    <h4>Data Protection Officer contact details</h4>\n    <p>The User can contact the Orange Innovation Data Protection Officer for any question related to personal data protection:</p>\n    <ul>\n      <li>by e-mail: group-dpo.donnees-personnelles@orange.com </li>\n      <li>by postal service:\n        Orange SA<br>\n        To the Data Protection Officer<br>\n        111 quai du Président Roosevelt<br>\n        92130 Issy-les-Moulineaux\n      </li>\n    </ul>\n    <h4>Are personal data transferred outside the EU?</h4>\n    <p>The personal data collected and processed by Orange Innovation is not subject to any transfer outside the European Union.</p>\n    <p>In case of transfer of personal data outside the European Union, Orange Innovation will take appropriate guarantees to ensure the protection of the User's data and the compliance with the applicable personal data protection regulations.</p>\n    <h4>How is the User's personal data secured?</h4>\n    <p>Orange Innovation undertakes to protect the User's personal data in a secure and confidential way, including when certain operations are carried out by suppliers. In this respect, appropriate technical and organizational measures to prevent loss, misuse, alteration and deletion of the User's personal data are implemented. These measures are tailored in line with the level of sensitivity of the data.</p>\n    <h4>Amendments to this Privacy Notice</h4>\n    <p>This Privacy Notice may be subject to amendments.</p>\n    <p>Last update: 07/31/2021.</p>",
    "REMOVE_DEVICE_DATA": "Remove all data on this device"
  },
  "INTERNAL_TERMS": {
    "CONTENT": "<h4>PREAMBLE</h4>\n    <p>The SuperCodingBall Service allows Users to learn about programming by creating a virtual football team and\n      programming the behavior of each of the players (hereinafter the <b>'Service'</b>).</p>\n    <p>The Service is provided by Orange SA, a French limited company (société anonyme) with capital of 10.640.226.396\n      €, headquartered at 111 quai du Président Roosevelt, 92130 Issy-les-Moulineaux, with offices at Orange Innovation,\n      40-48, Avenue de la République, 92320, Châtillon, France (<b>'Orange Innovation'</b>).</p>\n    <p>The Service is freely available as a WebApp via https://www.supercodingball.com and is open to any individual who\n      wishes to use the Service for his/her own needs and for strictly personal, non-commercial purposes, subject to all\n      terms and conditions herein.</p>\n    <p>The Service is provided free-of-charge.</p>\n    <p>Access to and use of the Service are subject to these General Conditions of Use (hereinafter the <b>'GCU'</b>),\n      which the User expressly accepts when registering for the Service or using the Service.</p>\n    <h4>ARTICLE 1 - DEFINITIONS</h4>\n    <p>In these GCU, the following terms shall, unless otherwise stated, have the meaning given to them in this\n      article:</p>\n    <ul>\n      <li><b>Application</b>: refers to the software application entitled SuperCodingBall, which provides access to the\n        Service and may be used for free via https://www.supercodingball.com (website).\n      </li>\n      <li><b>Networks</b>: Refers to the electronic communication networks open to the public operated by any operator,\n        whatever the technology or standards used by these networks (cable, satellite, ADSL, optical fibre, GSM, GPRS,\n        EDGE, UMTS, Wi-Fi, WIMAX, etc.).\n      </li>\n      <li><b>Device / Devices</b>: Refer to all terminal devices (particularly, but not only, touch-screen tablet-type\n        mobile devices) which may be connected to the Internet via the Networks.\n      </li>\n      <li><b>User</b>: Refers to a natural person, be it an adult or a minor who has obtained prior permission from\n        his/her legal representative, who uses the Service for his/her own needs and for purely personal, non-commercial\n        purposes.\n      </li>\n    </ul>\n    <h4>ARTICLE 2 – PURPOSE</h4>\n    <p>The purpose of these GCU is to lay down the conditions in which:</p>\n    <ul>\n      <li>the Service is made available to Users,</li>\n      <li>the Users must use the Service.</li>\n    </ul>\n    <h4>ARTICLE 3 – ACCESS TO THE SERVICE</h4>\n    <h5>3.1 Technical requirements</h5>\n    <p>In order to be able to use the Service from the Application, the User must have a device and an access to the\n      Networks. The Service is available online via https://www.supercodingball.com</p>\n    <h5>3.2 Activation of the Service </h5>\n    <p>The User undertakes to ensure that the information communicated and recorded during activation is reliable and\n      accurate and that it is constantly updated.</p>\n    <h4>ARTICLE 4 - COST OF THE SERVICE</h4>\n    <p>The Service is provided by ORANGE INNOVATION free of charge (excluding (i) mobile phone subscription costs (ii)\n      charges for connection and access to the Internet network).</p>\n    <h4>ARTICLE 5 – RESPONSIBILITY AND GUARANTEES OF THE USER</h4>\n    <h5>Obligation concerning the access to the Service</h5>\n    <p>The User undertakes to inform ORANGE INNOVATION of any unauthorised use of his/her account, or any other threat\n      to the security of his/her account.</p>\n    <p>The User undertakes to takes all the necessary measures to keep his/her login ID secret and not to disclose\n      them.</p>\n    <p>The User guarantees that he/she will comply with the terms of any contracts agreed with third parties that are\n      applicable within the context of use of the Application. In particular, the User must check that he/she is not in\n      violation of the terms of his/her (voice/data) subscription with his/her mobile phone operator.</p>\n    <h4>ARTICLE 6 - RESPONSIBILITY OF ORANGE INNOVATION</h4>\n    <p>ORANGE INNOVATION in no way guarantees that the Service and/or Application are error-free or suited to the\n      specific needs of the User.</p>\n    <h4>ARTICLE 7 – SUSPENSION AND TERMINATION</h4>\n    <p>ORANGE INNOVATION reserves the right to stop providing the Service without prior notice and without paying any\n      indemnity.</p>\n    <h4>ARTICLE 8 – PERSONAL DATA </h4>\n    <p>The User is solely responsible for the data that he/she communicates through the Service and declares that the\n      data provided are perfectly accurate and complete.</p>\n    <h5>Collect of personal data</h5>\n    <p>The User's personal data collected by the Service is processed and used for the purposes of managing the User's\n      registration for participation in the online game (creation of a profile and an associated avatar) and to manage\n      the ranking between players (storage of the result of games played. For more information on the protection of the\n      User's personal data and your rights, <a href=\"/privacy\">click here</a>.</p>\n    <p>The User may request any related information by contacting ORANGE INNOVATION in accordance with the provisions of\n      Article 11 below.</p>\n    <h4>ARTICLE 9 - INTELLECTUAL PROPERTY</h4>\n    <h5>9.1 Rights of the User</h5>\n    <p>The User is and remains the owner of the data in the Account and the messages sent and received by the User.</p>\n    <h5>9.2 Rights of ORANGE INNOVATION</h5>\n    <p>ORANGE INNOVATION is and remains the owner of its Service, the Application, software, software applications,\n      graphic guidelines, trademarks, logos, concepts, technologies, software, databases and content made available to\n      the Users, to the exclusion of any third party software, data or API used for the purpose of supplying the\n      Service.</p>\n    <p>The User recognises that he/she does not acquire any intellectual property rights over the elements belonging to\n      ORANGE INNOVATION or any elements from or in the Service. He/she shall also strictly refrain from using these\n      elements for any other purpose than that set out in these GCU.</p>\n    <p>Any improvements, updates, derived products or upgrades concerning the Service, be they performed, created or\n      developed by ORANGE INNOVATION, are and will remain the property of ORANGE INNOVATION, and you recognise and\n      expressly accept that any contribution in the form of services, suggestions, ideas, reports, identification or\n      defects, expenditure, or any other contribution made by the User shall not confer any right, title or interest in\n      any of the elements or components of the Service.</p>\n    <h5>9.3 Right of usage (licence)</h5>\n    <p>The source code of the Application is available under the terms and conditions of the BSD 3-clause licence\n      (https://spdx.org/licenses/BSD-3-Clause.html) on the following website\n      (https://github.com/Orange-OpenSource/super-coding-ball).</p>\n    <p>Thus, the User can use it in accordance with the terms of this license and subject to complying with these\n      GCU.</p>\n    <h4>ARTICLE 10 – APPLICABLE LAW AND GENERAL PROVISIONS</h4>\n    <p>If one or more stipulations of the present GCU should be declared null and void by application of a law or\n      regulation, or as the result of a definitive decision of a competent jurisdiction, the other stipulations shall\n      maintain all of their force and scope of applicability.</p>\n    <p>The stipulations declared null and void shall then be replaced by stipulations that are closer in content to the\n      initially decided stipulations.</p>\n    <p>The parties will not be held responsible, or considered as having breached these GCU, in the event of any delay\n      or incomplete performance caused by a case of force majeure as defined by the case law of the French courts.</p>\n    <p>These GCU are subject to French law.</p>\n    <h4>ARTICLE 11 - CONTACT</h4>\n    <p>Any claim or challenge concerning the Service must be sent by email in the 'Contact us' section of the\n      Application.</p>"
  }
}
