{
  "INTERNAL_LEGAL": {
    "ORANGE": "<h4>Informations légales</h4>\n    <h5>Informations éditeur</h5>\n    <p>\n      Orange SA<br>\n      Société anonyme de droit français au capital de 10 640 226 396 euros<br>\n      RCS Nanterre 380 129 866<br>\n      Siège social :<br>\n      111, quai du Président Roosevelt<br>\n      CS 70222<br>\n      92449 ISSY LES MOULINEAUX CEDEX<br>\n      France<br>\n      Tél. : + 33 1 44 44 22 22<br>\n      Directeur de la publication : Stéphane Richard\n    </p>\n\n    <h5>Crédits</h5>\n    Orange Innovation"
  },
  "INTERNAL_PRIVACY": {
    "CONTENT": "<p>La présente Notice Données à caractère personnel informe l'Utilisateur sur la façon dont Orange Innovation,\n      agissant en tant que responsable de traitement, traite ses données à caractère personnel dans le contexte de\n      SuperCodingBall.</p>\n    <p>Ce document est complété par des informations spécifiques relatives à la fourniture du service et décrites dans\n      les conditions générales correspondantes. À ce titre, il fait partie intégrante desdites conditions générales.</p>\n    <h4>Qu'est-ce que « SuperCodingBall » ?</h4>\n    <p>Le service SuperCodingBall permet à des Utilisateurs de s'initier à la programmation en créant une équipe de\n      football virtuelle et en programmant le comportement de chacun des joueurs.</p>\n    <h4>Pourquoi Orange Innovation traite-t-il des données à caractère personnel et sur quels fondements ?</h4>\n    <p>Par le biais de SuperCodingBall, Orange Innovation traite les données de l'Utilisateur à des fins de :</p>\n    <table class=\"table\">\n      <thead>\n      <tr>\n        <th>Finalités</th>\n        <th>Fondements</th>\n      </tr>\n      </thead>\n      <tr>\n        <td>Gérer l'inscription de l'Utilisateur pour la participation au jeu en ligne (création d'un profil et d'un\n          avatar associé)\n        </td>\n        <td>Ce traitement est justifié par l'exécution des CGU/CGV que l'Utilisateur a accepté lors de la souscription à\n          SuperCodingBall.\n        </td>\n      </tr>\n      <tr>\n        <td>Gérer le classement entre les joueurs (stockage du résultat des parties jouées)</td>\n        <td>Ce traitement est justifié par l'exécution des CGU/CGV que l'Utilisateur a accepté lors de la souscription à\n          SuperCodingBall.\n        </td>\n      </tr>\n      <tr>\n        <td>Assurer un suivi des activités d'Orange Innovation (reporting et statistique d'utilisation)</td>\n        <td>Ce traitement est fondé sur l'intérêt légitime d'Orange Innovation afin de mesurer la performance de son\n          activité et améliorer ses produits et services.\n        </td>\n      </tr>\n    </table>\n    <h4>Quelles sont les données à caractère personnel traitées ?</h4>\n    <p>Les données à caractère personnel qu'Orange Innovation collecte dans le cadre de ce service sont :</p>\n    <ul>\n      <li>Les données identifiants de l'Utilisateur (nom du compte et avatar associé)</li>\n    </ul>\n    <h4>Qui a accès aux données à caractère personnel de l'Utilisateur ?</h4>\n    <p>En raison de leurs fonctions et dans la limite de leurs attributions respectives, les données collectées sont\n      destinées uniquement :</p>\n    <ul>\n      <li>aux services internes habilités au sein d'Orange Innovation,</li>\n      <li>le(s) prestataire(s) en charge qui traitent les données selon les instructions d'Orange Innovation.</li>\n    </ul>\n    <p>Vous êtes informé que conformément aux lois et réglementations en vigueur, les données peuvent être transmises\n      aux autorités compétentes, à leur demande, en leur qualité de Tiers Autorisés.</p>\n    <h4>Combien de temps les données à caractère personnel sont-elles conservées ?</h4>\n    <p>Les données à caractère personnel de l'Utilisateur sont traitées tant que son compte utilisateur est actif. En\n      cas de désactivation, ses données seront conservées pendant 15 jours.</p>\n    <h4>Quels sont les droits de l'Utilisateur et comment les exercer ?</h4>\n    <p>L'utilisateur peut exercer ses droits d'accès, de rectification de ses données à caractère personnel à tout\n      moment. Un droit à l'effacement, un droit de limitation ou un droit d'opposition peuvent s'exercer également. Dans\n      certains cas, la portabilité de ses données est possible.</p>\n    <p>Lorsque le traitement de données à caractère personnel repose sur le consentement de l'Utilisateur, Orange\n      Innovation l'informe qu'il peut retirer ce consentement à tout moment.</p>\n    <p>L'Utilisateur peut émettre des directives sur la conservation, la suppression ou la communication de ses données\n      à caractère personnel après son décès.</p>\n    <p>Pour exercer ses droits, l'Utilisateur peut écrire à Orange Innovation en justifiant de son identité \n      dans la rubrique « Nous contacter » de l'Application.</p>\n    <p>L'Utilisateur est informé qu'il a le droit d'introduire une demande auprès de la Commission Nationale de\n      l'Informatique et des Libertés (CNIL), autorité de contrôle en charge du respect des obligations en matière de\n      données à caractère personnel en France. Orange Innovation encourage l'Utilisateur à la contacter avant toute\n      demande, pour essayer de la résoudre.</p>\n    <h4>Coordonnées du Délégué à la protection des données</h4>\n    <p>L'Utilisateur a la possibilité de contacter le délégué à la protection des données d'Orange Innovation pour des\n      questions relatives à la protection des données à caractère personnel :</p>\n    <ul>\n      <li>par e-mail : group-dpo.donnees-personnelles@orange.com</li>\n      <li>par voie postale :\n        Orange SA<br>\n        À l'attention du Délégué à la Protection des Données<br>\n        111 quai du Président Roosevelt<br>\n        92130 Issy-les-Moulineaux\n      </li>\n    </ul>\n    <h4>Les données à caractère personnel sont-elles transférées hors UE ?</h4>\n    <p>Les données à caractère personnel collectées et traitées par Orange Innovation ne font l'objet d'aucun transfert\n      hors de l'Union Européenne.</p>\n    <p>En cas de transfert des données à caractère personnel hors de l'Union Européenne, Orange Innovation prendra les\n      garanties appropriées, notamment contractuelles, afin d'assurer la protection des données de l'Utilisateur et la\n      conformité avec la réglementation applicable en matière de protection des données à caractère personnel.</p>\n    <h4>Comment sont sécurisées vos données à caractère personnel ?</h4>\n    <p>Orange Innovation s'assure que les données de l'Utilisateur sont traitées en toute sécurité et confidentialité, y\n      compris lorsque certaines opérations sont réalisées par des sous-traitants. À cet effet les mesures techniques et\n      organisationnelles appropriées pour éviter la perte, la mauvaise utilisation, l'altération et la suppression des\n      données à caractère personnel le concernant sont mises en place. Ces mesures sont adaptées selon le niveau de\n      sensibilité des données.</p>\n    <h4>Modifications de la présente Notice Données à caractère personnel</h4>\n    <p>La présente Notice Données à caractère personnel peut être amenée à évoluer. </p>\n    <p>Dernière mise à jour : 31/07/2021.</p>",
    "REMOVE_DEVICE_DATA": "Effacer les données sur cet appareil"
  },
  "INTERNAL_TERMS": {
    "CONTENT": "<h4>PRÉAMBULE</h4>\n    <p>Le service SuperCodingBall permet à des Utilisateurs de s'initier à la programmation en créant une équipe de\n      football virtuelle et en programmant le comportement de chacun des joueurs (ci-après le <b>« Service »</b>).</p>\n    <p>Ce Service est fourni par la société Orange, Société Anonyme au capital de 10.640.226.396 Euros, immatriculée au\n      Registre du Commerce et des Société de Nanterre sous le numéro RCS Nanterre B 380 129 866 dont le siège social est\n      situé 111 quai du Président Roosevelt, 92130 Issy-les-Moulineaux, domiciliée aux fins des présentes à Orange\n      Innovation Produits & Services, 40-48, Avenue de la République, 92320, Châtillon (ci-après <b>« Orange Innovation\n        »</b>).</p>\n    <p>Le Service, disponible gratuitement à partir de l'URL suivante : https://www.supercodingball.com, est ouvert à\n      toute personne physique souhaitant l'utiliser pour ses besoins propres et dans le cadre d'un usage strictement\n      personnel et non commercial, et cela sous réserve du respect de l'intégralité des présentes conditions.</p>\n    <p>L'accès et l'utilisation du Service sont soumis aux présentes Conditions Générales d'Utilisation (ci-après les\n      <b>« CGU »</b>) que l'Utilisateur accepte expressément lors de son inscription au Service ou de son utilisation du\n      Service.</p>\n    <p>L'Utilisateur s'engage à utiliser le Service conformément à l'usage auquel il est destiné. L'utilisation du\n      Service par l'Utilisateur relève de sa propre responsabilité.</p>\n    <h4>ARTICLE 1 - DÉFINITIONS</h4>\n    <p>Dans les présentes CGU, les termes suivants ont, sauf précision contraire, le sens qui leur est donné dans cet\n      article :</p>\n    <ul>\n      <li><b>Réseaux</b> : désignent les réseaux de communications électroniques ouverts au public interconnectés et\n        exploités par tout opérateur quelles que soient les technologies ou les normes utilisées par ces réseaux (câble,\n        satellite, ADSL, fibre optique, GSM, GPRS, EDGE, UMTS, Wi-Fi, WIMAX, etc.).\n      </li>\n      <li><b>Terminal / Terminaux</b> : désignent tous équipements terminaux (en particulier, mais de façon non\n        limitative, les ordinateurs, les téléphones mobiles et tablettes tactiles) susceptibles d'être connectés à\n        l'Internet via les Réseaux.\n      </li>\n      <li><b>Utilisateur</b> : désigne une personne physique majeure ou mineure ayant obtenu au préalable l'autorisation\n        de son représentant légal, et utilisant le Service, pour ses besoins propres, dans le cadre d'un usage\n        strictement personnel et non commercial.\n      </li>\n    </ul>\n    <h4>ARTICLE 2 – OBJET</h4>\n    <p>Les présentes CGU ont pour objet de définir les conditions dans lesquelles :</p>\n    <ul>\n      <li>le Service est mis à disposition de l'Utilisateur,</li>\n      <li>l'Utilisateur doit utiliser le Service.</li>\n    </ul>\n    <h4>ARTICLE 3 – ACCÈS AU SERVICE</h4>\n    <h5>3.1 Pré-requis techniques</h5>\n    <p>Pour pouvoir utiliser le Service, l'Utilisateur doit disposer d'un Terminal et d'un accès aux Réseaux. Le Service\n      est accessible en ligne sur le site : https://www.supercodingball.com</p>\n    <h5>3.2 Activation du Service</h5>\n    <p>L'Utilisateur s'engage à ce que les informations communiquées lors de l'activation soient fiables et conformes à\n      la réalité et mises à jour en permanence.</p>\n    <h4>ARTICLE 4 - COUT DU SERVICE</h4>\n    <p>Le Service est proposé par Orange Innovation à titre gratuit (hors frais (i) d'abonnement de téléphonie mobile et\n      (ii) de connexion et d'accès au réseau Internet).</p>\n    <h4>ARTICLE 5 - RESPONSABILITÉ ET GARANTIES DE L'UTILISATEUR</h4>\n    <h5>Obligation relatives à l'accès au Service</h5>\n    <p>L'Utilisateur s'engage à avertir Orange Innovation de toute utilisation non autorisée de son compte, ou de toute\n      autre atteinte à la sécurité de celui-ci.</p>\n    <p>L'Utilisateur s'engage à mettre en œuvre toutes les mesures nécessaires pour conserver secrets les identifiants\n      de connexion et à ne pas les divulguer sous quelque forme que ce soit.</p>\n    <p>L'Utilisateur garantit se conformer aux termes des contrats conclus avec des tiers et applicables dans le cadre\n      de l'utilisation de l'Application.</p>\n    <p>En particulier, l'utilisateur doit s'assurer ne pas être en violation des termes de son abonnement souscrit\n      auprès de son opérateur de téléphonie mobile (voix/data) ou de son fournisseur d'Internet.</p>\n    <p>L'Utilisateur s'engage à ne pas utiliser le service pour un usage illégal ou interdit par les présentes CGU et/ou\n      toute loi applicable.</p>\n    <h4>ARTICLE 6 - RESPONSABILITÉ D'ORANGE INNOVATION</h4>\n    <p>Orange Innovation ne garantit en aucune manière que le Service et/ou l'Application sont exempts d'erreurs ou\n      adaptés aux besoins spécifiques de l'Utilisateur.</p>\n    <h4>ARTICLE 7 – SUSPENSION - RÉSILIATION</h4>\n    <p>Orange Innovation se réserve le droit de mettre un terme au Service sans préavis et sans indemnité. L'Utilisateur\n      est libre de cesser d'utiliser le Service à tout moment. En cas de non-respect des CGU par l'Utilisateur, Orange\n      Innovation se réserve le droit d'interrompre de manière temporaire ou définitif l'accès au Service.</p>\n    <h4>ARTICLE 8 - DONNÉES PERSONNELLES</h4>\n    <p>L'Utilisateur est seul responsable des données qu'il communique au travers du Service et déclare que les données\n      fournies sont parfaitement renseignées et exactes.</p>\n    <h5>Collecte de données à caractère personnel</h5>\n    <p>Les données à caractère personnel de l'Utilisateur recueillies dans le cadre du service sont traitées afin de\n      gérer l'inscription de l'Utilisateur pour la participation au jeu en ligne (création d'un profil et d'un avatar\n      associé) et gérer le classement entre les joueurs (stockage du résultat des parties jouées). Pour plus\n      d'informations sur la gestion des données à caractère personnel et des droits de l'Utilisateur, <a\n        href=\"/privacy\">cliquez ici</a>.</p>\n    <p>L'Utilisateur peut demander toute information afférente en contactant Orange Innovation conformément aux\n      dispositions de l'article 11 ci-après.</p>\n    <h4>ARTICLE 9 - PROPRIETE INTELLECTUELLE</h4>\n    <h5>9.1 Droit de l'Utilisateur</h5>\n    <p>L'Utilisateur est et reste propriétaire des données du compte et des messages envoyés ou reçus par\n      l'Utilisateur.</p>\n    <h5>9.2 Droit d'Orange Innovation</h5>\n    <p>Orange Innovation est et reste propriétaire de son Service, de l'Application, logiciels, applications\n      logicielles, charte graphique, marques, logos, concepts, technologie, logiciels, bases de données, contenus mis à\n      la disposition des Utilisateurs, à l'exclusion de tous logiciels de tiers ou API utilisés pour les besoins du\n      Service.</p>\n    <p>L'Utilisateur reconnaît qu'il n'acquiert aucun droit de propriété intellectuelle sur les éléments, appartenant à\n      Orange Innovation ou provenant du Service. Il s'interdit en outre formellement de les utiliser dans un cadre autre\n      que celui exclusivement prévu aux présentes CGU.</p>\n    <p>Toutes les améliorations, mises à jour, produits dérivés, évolutions, qu'elles soient réalisées, créés ou\n      développés par Orange Innovation concernant le Service sont et demeureront la propriété de Orange Innovation, et\n      l'Utilisateur reconnait et accepte expressément que toute contribution sous forme de services, de suggestions,\n      d'idées, de rapports, d'identification des défauts, de dépenses, ou toutes autres contributions faites par\n      l'Utilisateur, ne donne ou accorde aucun droit, titre ou intérêt dans l'un quelconque des éléments ou composants\n      du Service.</p>\n    <h5>9.3 Droit d'usage (licence)</h5>\n    <p>Le code source de l'Application est disponible selon les termes et conditions de la licence BSD 3-clause\n      (https://spdx.org/licenses/BSD-3-Clause.html) sur le site Internet suivant\n      (https://github.com/Orange-OpenSource/super-coding-ball).</p>\n    <p>Ainsi l'Utilisateur peut l'utiliser dans le respect des termes de cette licence et sous réserve de se conformer\n      aux présentes CGU.</p>\n    <h4>ARTICLE 10 - LOI APPLICABLE – DISPOSITIONS GÉNÉRALES</h4>\n    <p>Si une ou plusieurs stipulations des présentes CGU sont nulles ou déclarées comme telles en application d'une\n      loi, d'un règlement ou à la suite d'une décision définitive d'une juridiction compétente, les autres stipulations\n      garderont toute leur force et leur portée.</p>\n    <p>Les stipulations déclarées nulles et non valides seront alors remplacées par des stipulations qui se\n      rapprocheront le plus quant à leur contenu des stipulations initialement arrêtées.</p>\n    <p>Les parties ne seront pas tenues pour responsables, ou considérées comme ayant failli aux présentes CGU, pour\n      tout retard ou inexécution, lorsque la cause du retard ou de l'inexécution est liée à un cas de force majeure\n      telle que définie par la jurisprudence des tribunaux français.</p>\n    <p>Les présentes CGU sont soumises à la loi française.</p>\n    <h4>ARTICLE 11 - CONTACT</h4>\n    <p>Toute réclamation ou contestation relative au Service doit être transmise par courrier électronique, dans la\n      rubrique « Nous contacter » de l'Application.</p>"
  }
}
